---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.BendDiameterNegative
source: html/4d27b9c9-21ce-2724-de01-e0435298ef7d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.BendDiameterNegative Property

Fabric Bend Diameter is negative.

## Syntax (C#)
```csharp
public static FailureDefinitionId BendDiameterNegative { get; }
```